[
  {
    "stem": "Can this authenticator be both a possession and biometric factor type?",
    "options": [
      {"text": "FIDO2/WebAuthn",  "correct": true}
    ]
  },
  {
    "stem": "Is this a statement type that is included in a SAML assertion?",
    "options": [
      {"text": "Profile",      "correct": false},
      {"text": "Authorization", "correct": true},
      {"text": "Federation",     "correct": false},
      {"text": "Schema",  "correct": false},
      {"text": "Attribution",  "correct": true},
      {"text": "Authentication",     "correct": true}
    ]
  },
  {
    "stem": "Can an Okta Administrator use this query to identify user creation events in the Okta System log?",
    "options": [
      {"text": "user.account.create",  "correct": false},
      {"text": "user.lifecycle.new",  "correct": false},
      {"text": "application.user_membership.create",  "correct": false},
      {"text": "user.lifecycle.create",  "correct": true}
    ]
  },
  {
    "stem": "Is this a way to receive status information and alerts on the Okta Service?",
    "options": [
      {"text": "Use the Okta Org Admin API to receive Okta Status alerts",  "correct": false},
      {"text": "Subscribe to receive alerts from the Okta Community page",  "correct": false}
    ]
  },
  {
    "stem": "An Okta Administrator has integrated a third-party application to their company's Okta org.<br />Is this what the administrator must do to enable automatic updates of an Okta user attribute in the application?",
    "options": [
      {"text": "In Profile Editor, enable update user attribute in the application and map the attribute to the application",  "correct": true},
      {"text": "Map the attribute from the application to Okta",  "correct": false}
    ]
  },
  {
    "stem": "Is this a true statement about configuring Okta FastPass?",
    "options": [
      {"text": "An Okta Administrator must create a new password policy for Okta FastPass",  "correct": false},
      {"text": "All versions of Okta Verify are compatible with Okta FastPass",  "correct": false},
      {"text": "An Okta Administrator needs to configure a Global Session Policy for Okta FastPass",  "correct": true},
      {"text": "An Okta Group must be created that includes all users who will be using Okta FastPass",  "correct": false}
    ]
  },
  {
    "stem": "An Okta Administrator is running the Okta Active Directory (AD) agent installer to install the AD Agent on a domain joined server.<br />Is this the minimum AD user account permission required to run the installer?",
    "options": [
      {"text": "Domain User",  "correct": false},
      {"text": "Local Administrator",  "correct": true}
    ]
  },
  {
    "stem": "Is this a true statement about what happens when an Okta account is suspended?",
    "options": [
      {"text": "An Okta administrator <strong>CANNOT</strong> perform profile updates on the Okta account",  "correct": false},
      {"text": "All application assignments are removed and the password is permanently deleted for the Okta account",  "correct": false},
      {"text": "The Okta user can sign in to Okta to access applications",  "correct": false},
      {"text": "The Okta user <strong>CANNOT</strong> access their applications or the Okta End-User dashboard. Their application assignments are unaffected and their user profile can be updated.",  "correct": true}
    ]
  },
  {
    "stem": "Is this a true statement about Global Session Policy persistent cookies?",
    "options": [
      {"text": "If a user quits their browser and reopens the browser, the browser session is persisted unless the user has signed out.",  "correct": true}
    ]
  },
  {
    "stem": "Is this what happens when a user launches a Service Provider (SP) initiated application from the Okta Dashboard?",
    "options": [
      {"text": "The user will be Just-In-Time (JIT) provisioned into the application",  "correct": false},
      {"text": "The user will be assigned to the application",  "correct": false},
      {"text": "The user will receive an error from the downstream application",  "correct": true},
      {"text": "The user will be signed out of Okta",  "correct": false}
    ]
  },
  {
    "stem": "Is this a browser that the Okta Browser Plugin does <strong>NOT</strong> support?",
    "options": [
      {"text": "Microsoft Edge",  "correct": false},
      {"text": "Google Chrome",  "correct": false},
      {"text": "Mozilla Firefox",  "correct": false},
      {"text": "Internet Explorer 11",  "correct": true}
    ]
  },
  {
    "stem": "Can these base Okta user profile attributes be set to be \"optional\" or \"required\" for Okta sourced users?",
    "options": [
      {"text": "Email and Title",  "correct": false},
      {"text": "FirstName and LastName",  "correct": true},
      {"text": "City and State",  "correct": false}
    ]
  },
  {
    "stem": "Is this a supported option for Okta Verify number challenges?",
    "options": [
      {"text": "Never",  "correct": true},
      {"text": "Only for high risk sign-in attempts",  "correct": true},
      {"text": "All push challenges",  "correct": true},
      {"text": "Always",  "correct": false}
    ]
  },
  {
    "stem": "Is this a true statement about search filters in the Tasks dashboard in Okta?",
    "options": [
      {"text": "Tasks can be filtered by users",  "correct": true},
      {"text": "Tasks <strong>CANNOT</strong> be filtered by group",  "correct": false},
      {"text": "Tasks can be filtered by application",  "correct": true},
      {"text": "Tasks <strong>CANNOT</strong> be filtered by date",  "correct": false},
      {"text": "Tasks can be filtered by authentication",  "correct": false}
    ]
  },
  {
    "stem": "An administrator needs to use Okta to control application assignment based on user profile attributes.<br />Is this what the administrator needs to configure?",
    "options": [
      {"text": "Okta sign-on policy",  "correct": false},
      {"text": "Universal Directory",  "correct": false},
      {"text": "Group Rule",  "correct": true},
      {"text": "Application sign-on policy",  "correct": false}
    ]
  },
  {
    "stem": "An IT professional wants to ensure that attributes for the Okta user profile are properly mapped to various applications.<br />Does the following action achieve this goal?",
    "options": [
      {"text": "Verify directory and application profile mastery",  "correct": false},
      {"text": "Verify a mapping between the Okta user profile and the app user profile",  "correct": true}
    ]
  },
  {
    "stem": "Is it appropriate to use Agent-based Provisioning in an environment that has following service or element?",
    "options": [
      {"text": "G Suite used for email and calendaring",  "correct": false},
      {"text": "Active Directory Federated Services",  "correct": false},
      {"text": "An on-premises Active Directory service",  "correct": true},
      {"text": "An on-premises Lightweight Directory Access Protocol (LDAP) service",  "correct": true}
    ]
  },
  {
    "stem": "Is the following statement a valid reason for selecting Security Assertion Markup Language (SAML) over Secure Web Authentication (SWA)?",
    "options": [
      {"text": "SWA applications can be configured to authenticate without the use of passwords",  "correct": false},
      {"text": "SAML is standards based and allows for interoperability among multiple vendors",  "correct": true},
      {"text": "SWA applications are not required to use HTTPS for secure password submission",  "correct": false}
    ]
  },
  {
    "stem": "An IT professional is configuring several SaaS applications for access by directory-mastered users who use form-based authentication.<br />Which authentication method is appropriate for this scenario?",
    "options": [
      {"text": "Okta Verify",  "correct": false},
      {"text": "SMS",  "correct": false},
      {"text": "WS-Fed",  "correct": false},
      {"text": "SAML",  "correct": false},
      {"text": "SWA",  "correct": true}
    ]
  },
  {
    "stem": "Is this attribute required when creating a new Okta mastered user account?",
    "options": [
      {"text": "Secondary email",  "correct": false},
      {"text": "Department",  "correct": false},
      {"text": "Primary email",  "correct": true},
      {"text": "Phone number",  "correct": false}
    ]
  },
  {
    "stem": "Is this a true statement about the functionality available to Okta end users?",
    "options": [
      {"text": "Okta end users can deactivate their accounts",  "correct": false},
      {"text": "Okta end users can modify the arrangement of application icons on their dashboard",  "correct": true},
      {"text": "Okta end users can enable auto-launch for dashboard applications",  "correct": true},
      {"text": "Okta end users can upload a photo as their security image",  "correct": false},
      {"text": "Okta end users can modify their username",  "correct": false},
      {"text": "Okta end users can change the Okta user interface display language",  "correct": true}
    ]
  },
  {
    "stem": "Does the Okta Mobile app allow an end user to do this?",
    "options": [
      {"text": "Notify the user of incoming emails through Okta apps",  "correct": false},
      {"text": "Track a user's location",  "correct": false},
      {"text": "Access web applications through Okta Single Sign-On (SSO)",  "correct": true}
    ]
  },
  {
    "stem": "Does this multifactor authentication (MFA) type provide strong and effective resistance against man-in-the-middle (MITM) attacks?",
    "options": [
      {"text": "Voice",  "correct": false},
      {"text": "SMS",  "correct": false},
      {"text": "Universal 2nd Factor (U2F)",  "correct": true}
    ]
  },
  {
    "stem": "Is this a required step to integrate Okta with an LDAP directory?",
    "options": [
      {"text": "Install and configure the Okta LDAP Agent",  "correct": true},
      {"text": "Install and configure the Okta Active Directory Agent",  "correct": false},
      {"text": "Create a new LDAP directory",  "correct": false}
    ]
  },
  {
    "stem": "An end user is experiencing an issue with the Okta Browser plugin.<br />Is this the first step an administrator should take to troubleshoot the issue?",
    "options": [
      {"text": "Review the dashboard in the Okta Administrator application",  "correct": false},
      {"text": "Verify the Okta Browser plugin is enabled",  "correct": true},
      {"text": "Review the service history at trust.okta.com",  "correct": false}
    ]
  },
  {
    "stem": "Does this statement correctly describe how the Okta Integration Network (OIN) is used in the Okta Service?",
    "options": [
      {"text": "OIN apps are available to all Okta customers",  "correct": true},
      {"text": "All applications in the OIN have been integrated by Okta and been tested by Okta engineers",  "correct": false},
      {"text": "The OIN contains information about whether an application supports provisioning",  "correct": true},
      {"text": "All apps in the OIN support SAML",  "correct": false},
      {"text": "Applications can be added to the OIN by the Okta community",  "correct": true}
    ]
  },
  {
    "stem": "Company policy dictates that multifactor authentication (MFA) is required when accessing corporate applications.<br />Is this an Okta-provided MFA option?",
    "options": [
      {"text": "Okta Mobile",  "correct": false},
      {"text": "Okta Mobility Management",  "correct": false},
      {"text": "Okta Verify",  "correct": true},
      {"text": "Okta Authenticator",  "correct": false},
      {"text": "SMS Authenticator",  "correct": true}
    ]
  },
  {
    "stem": "Is this what an administrator must do to integrate Okta with an application that supports federation but is NOT in the Okta Integration Network (OIN)?",
    "options": [
      {"text": "Create a Secure Web Authentication (SWA) application",  "correct": false}, 
      {"text": "Clone and modify a similar application from the OIN",  "correct": false},
      {"text": "Create a SAML application using the Application Integration Wizard (AIW)",  "correct": true},
      {"text": "Request that Okta add the application to OIN",  "correct": false},
      {"text": "Create a WS-FED template application",  "correct": true}
    ]
  },
  {
    "stem": "The Active Directory (AD) administrator of a company wants to integrate its directory services with Okta.<br />Will the following action provide redundancy for delegated user authentication?",
    "options": [
      {"text": "Install two or more Okta AD Agents on separate domain member servers",  "correct": true}
    ]
  },
  {
    "stem": "The IT department has determined that all new employees will receive access to Office365, Concur, and Workday applications on their first day of work. Some employees in specific deparments additionally require access to the Skytap, WebEx, and Asana applications, depending upon their job role.<br />Can an employee use this Okta self-service option to gain access to the three additional applications?",
    "options": [
      {"text": "Change settings on their homepage to allow IT to directly add the new applications",  "correct": false},
      {"text": "Create an application task in the end-user home page",  "correct": false},
      {"text": "Email the IT deparment asking for access to the applications",  "correct": false},
      {"text": "Make an application request via +Add Apps feature",  "correct": true}
    ]
  },
  {
    "stem": "Is this a true statement about attribute mappings?",
    "options": [
      {"text": "Attribute mappings can be disabled",  "correct": true},
      {"text": "Attribute always have to be mapped",  "correct": false},
      {"text": "Attribute can be applied on user deactivation",  "correct": false},
      {"text": "Attributes can be applied when creating or updating users",  "correct": true}
    ]
  },
  {
    "stem": "Is this a method of configuring groups within Okta?",
    "options": [
      {"text": "Using the Okta Administrator Application",  "correct": true},
      {"text": "Importing from a CSV file",  "correct": false},
      {"text": "Importing from Active Directory",  "correct": true},
      {"text": "Importing an LDAP Data Interchange Format (LDIF) file",  "correct": false},
      {"text": "Importing from a database",  "correct": false}
    ]
  },
  {
    "stem": "Is this the policy to implement if an administrator needs to ensure that end users are prompted for multifactor authentication (MFA) when they attempt to log in to Okta?",
    "options": [
      {"text": "Password Policy",  "correct": false},
      {"text": "Application sign-on policy",  "correct": false},
      {"text": "Single Sign-On (SSO) policy",  "correct": false},
      {"text": "Sign-on Policy",  "correct": true}
    ]
  },
  {
    "stem": "A company has recently deployed Okta and set up many web-based corporate applications to use Okta Single Sign-On (SSO). Prior to the Okta deployment, user access was managed through Active Directory (AD) users and departmental groups. More than 5,000 users and departmental groups were imported from the AD domain into the Universal Directory. Given this set of conditions, is this the proper method for granting access to an Okta-connected order management application for all users in the accounting department?",
    "options": [
      {"text": "Import the AD group into the accounting application",  "correct": false},
      {"text": "Assign the imported AD accounting group to the application",  "correct": true},
      {"text": "Enable AD group provisioning in the accounting application",  "correct": false}
    ]
  },
  {
    "stem": "An administrator needs to create a rule to enforce multifactor authentication (MFA) for only the Microsoft Office 365 application and <strong>NOT</strong> for the entire Okta org.<br />Is this the policy the administrator should create?",
    "options": [
      {"text": "Okta sign-on",  "correct": false},
      {"text": "Password",  "correct": false},
      {"text": "Application sign-on",  "correct": true}
    ]
  },
  {
    "stem": "Is this what happens when an Okta Administrator changes the theme of an Okta org?",
    "options": [
      {"text": "Theme of Okta Mobile changes",  "correct": false},
      {"text": "Theme of the Okta Administrator Application changes",  "correct": false},
      {"text": "Theme of the Okta end user dashboard changes",  "correct": true},
      {"text": "Theme of Okta Verify changes",  "correct": false}
    ]
  },
  {
    "stem": "Is this a valid user status?",
    "options": [
      {"text": "Password Reset",  "correct": true},
      {"text": "Removed",  "correct": false},
      {"text": "Reactivated",  "correct": false},
      {"text": "Pending Activation",  "correct": true},
      {"text": "Deactivated",  "correct": true},
      {"text": "Active",  "correct": true}
    ]
  },
  {
    "stem": "An Okta Administrator is configuring a cloud application from the Okta Integration Network (OIN) so that the following User Lifecycle Management functions are enabled: Create, Read, Update, and Deactivate.<br />Is this a true statement?",
    "options": [
      {"text": "When an Okta user is unassigned from the cloud application, Okta automatically deprovisions a user profile from the cloud application.",  "correct": true},
      {"text": "When an Okta user is unassigned from the cloud application, Okta purges user history from the application logs",  "correct": false},
      {"text": "When an Okta user is assigned to the cloud application, Okta automatically creates a user profile in the cloud application",  "correct": true}
    ]
  },
  {
    "stem": "A member of the IT team is setting up authentication for Office 365 within the Okta Administrator Application. Company policy dictates that users are not required to input a separate password when accessing this application. Will the following configuration support the company policy?",
    "options": [
      {"text": "Configure authentication using multifactor authentication",  "correct": false},
      {"text": "Configure authentication using Secure Web Authentication (SWA)",  "correct": false},
      {"text": "Configure an application user profile for Office 365",  "correct": false},
      {"text": "Configure authentication using Web Services Federation (WS-Fed)",  "correct": true}
    ]
  },
  {
    "stem": "Is this an Okta feature you can use to automate application assignment to directory-mastered users?",
    "options": [
      {"text": "Policies",  "correct": false},
      {"text": "Profile Masters",  "correct": false},
      {"text": "Roles",  "correct": false},
      {"text": "Group Rules",  "correct": true}
    ]
  },
  {
    "stem": "Can an IT professional use this method to integrate applications into Okta?",
    "options": [
      {"text": "Application sign-on policy",  "correct": false},
      {"text": "Okta Integration Network (OIN)",  "correct": true}
    ]
  },
  {
    "stem": "Can an Okta-mastered end user complete a self-service password reset by performing the following action?",
    "options": [
      {"text": "Use Okta Mobile instead of a password reset",  "correct": false},
      {"text": "Visit okta.com/password to initiate a reset",  "correct": false},
      {"text": "Use Okta Verify instead of a password to gain access",  "correct": false},
      {"text": "Select the Forgot Password option from the log on screen",  "correct": true}
    ]
  },
  {
    "stem": "Is this the Okta support offering that provides a customer with a named Customer Success Manager (CSM)?",
    "options": [
      {"text": "Premier Success",  "correct": false},
      {"text": "Premier Access Success",  "correct": false},
      {"text": "Okta For Good",  "correct": false},
      {"text": "Premier Plus Success",  "correct": true}
    ]
  },
  {
    "stem": "Is this an example of an identity and access management (IAM) feature provided by Okta?",
    "options": [
      {"text": "Policies for enforcing sign-on behavior, multifactor authentication (MFA), and password complexity",  "correct": true},
      {"text": "Active Directory (AD) integration that allows users to authenticate through Okta",  "correct": true},
      {"text": "Remote application performance monitoring",  "correct": false},
      {"text": "Employee system of record",  "correct": true},
      {"text": "Multifactor authentication (MFA) into Okta and into applications protected by Okta",  "correct": true},
      {"text": "HR-driven IT Provisioning",  "correct": true}
    ]
  },
  {
    "stem": "A user cannot remember their credentials for a Secure Web Authentication (SWA) app.<br />Does this feature in Okta help a user retrieve their credentials?",
    "options": [
      {"text": "Password Reveal",  "correct": true},
      {"text": "Remember Me",  "correct": false}
    ]
  },
  {
    "stem": "Does this security authentication factor generate a six-digit code using the industry-standard algorithm, also known as a soft-token?",
    "options": [
      {"text": "Okta Verify",  "correct": true},
      {"text": "YubiKey",  "correct": false},
      {"text": "Security Question",  "correct": false},
      {"text": "Google Authenticator",  "correct": true}
    ]
  },
  {
    "stem": "Is this statement about profile mastering in Okta true?",
    "options": [
      {"text": "It defines the Admin roles",  "correct": false},
      {"text": "It defines which Create, Read, Update, Deprovision (CRUD) actions can be performed in an application",  "correct": false},
      {"text": "It defines where the profile is created and maintained",  "correct": true},
      {"text": "It defines where the Okta user profile's attributes will be derived",  "correct": true}
    ]
  },
  {
    "stem": "A help desk employee notices that when users are assigned to the Sales group in Okta, the new Salesforce accounts for the assigned users are not being automatically created in the Salesforce application, as expected.<br />Will this action correct the issue?",
    "options": [
      {"text": "Turn on Attribute-level Mastering and enable [Create user name, Update user name, and Deactivate user name] for the Salesforce application user profile",  "correct": false},
      {"text": "Import users from the target application and enable Profile Master for the Salesforce application",  "correct": false},
      {"text": "Apply an application-level sign-on policy to the Salesforce application",  "correct": false},
      {"text": "Turn on the [Create User, Update user, and Deactivate user] provisioning features for the Salesforce application.=",  "correct": true}
    ]
  },
  {
    "stem": "A company is discussing how to integrate its current IT infrastructure with Okta and with cloud applications using the Okta Integration Network (OIN). The company wants to completely centralize the application authentication process and eliminate the need to manage passwords.<br />Will the following authentication method ensure that these goals are met?",
    "options": [
      {"text": "Secure Web Authentication (SWA)",  "correct": false},
      {"text": "API",  "correct": false},
      {"text": "Security Assertion Markup Language (SAML)",  "correct": true},
      {"text": "Workday as a master",  "correct": false}
    ]
  },
  {
    "stem": "A customer opens a support case and the technician assigns it as a severity level of P1.<br />Is the following an example of a situation that warrants security level P1?",
    "options": [
      {"text": "Users authenticate to Okta but are receiving random 'Page Not Found' errors",  "correct": false},
      {"text": "A service interruption is affecting multiple users and preventing access",  "correct": true},
      {"text": "All users are receiving a 'Page Not Found' message during authentication",  "correct": true},
      {"text": "Users are unable to access some non-critical applications",  "correct": false},
      {"text": "A critical business application is inaccessible by all employees",  "correct": true}
    ]
  },
  {
    "stem": "If the system is properly configured, is this an action that an Okta-mastered user can perform without the aid of an administrator?",
    "options": [
      {"text": "Change a Forgotten Password question",  "correct": true},
      {"text": "Modify a telephone number",  "correct": true},
      {"text": "Upload a custom security image from a personal photo library",  "correct": false},
      {"text": "Change a password",  "correct": true},
      {"text": "Add a custom field to the user profile",  "correct": false}
    ]
  },
  {
    "stem": "A company's IT department is integrating its Active Directory structure with Okta. For convenience, directory-mastered users must have the ability to change their Active Directory passwords within Okta. Although the AD user accounts are being successfully imported into Okta, users are unable to change their passwords.<br />Is the following condition preventing users from changing their passwords?",
    "options": [
      {"text": "Desktop Single Sign-On (SSO) is enabled",  "correct": false},
      {"text": "Delegated authentication is disabled",  "correct": true},
      {"text": "An Okta Active Directory Service Account has not been created yet",  "correct": false}
    ]
  },
  {
    "stem": "A company decides to increase Okta org security policies by applying stricter password policies for both employees and for Okta administrators. Additionally, the company wants Okta administrators to use Okta Verify as a second factor.<br />Is this the correct way to order groups in the Sign-On Policies?",
    "options": [
      {"text": "Employees group nested inside Adminsitrators group",  "correct": false},
      {"text": "Employees group then Administrators group",  "correct": false},
      {"text": "Administrators group then Employees group",  "correct": true},
      {"text": "Administrators group and Employees group at the same level",  "correct": false}
    ]
  },
  {
    "stem": "Employees in a company's marketing department share access to several social media accounts that require usernames and passwords.<br />Is this the authentication method that should be used to configure shared access to these applications?",
    "options": [
      {"text": "SCIM",  "correct": false},
      {"text": "SAML",  "correct": false},
      {"text": "SWA",  "correct": true}
    ]
  },
  {
    "stem": "Is this what an Okta Administrator should do to determine which Secure Web Authentication (SWA) applications can be converted to SAML?",
    "options": [
      {"text": "Run the SAML Capable Apps report",  "correct": true}
    ]
  },
  {
    "stem": "Is this resource directly available on the Okta Help Center home page?",
    "options": [
      {"text": "Release Notes",  "correct": true},
      {"text": "System Log",  "correct": false},
      {"text": "System Status",  "correct": true}
    ]
  },
  {
    "stem": "Is this a self-service task that an end user can perform when an Okta Administrator configures the corresponding option?", 
    "options": [
      {"text": "Automatically launch an application when logging in to Okta",  "correct": true},
      {"text": "Change the multifactor authentication (MFA) factor",  "correct": true},
      {"text": "Request a password reset email",  "correct": true},
      {"text": "Request a multifactor authentication (MFA) reset email",  "correct": false},
      {"text": "Change the password policy",  "correct": false}
    ]
  },
  {
    "stem": "Is this a true statement about an Okta Early Access (EA) feature?",
    "options": [
      {"text": "It is still in Beta",  "correct": false},
      {"text": "It is a new or enhanced functionality",  "correct": true},
      {"text": "It is <strong>NOT</strong> supported by Okta Customer Support",  "correct": false},
      {"text": "It is available for eligible customers to selectively opt-in",  "correct": true}
    ]
  },
  {
    "stem": "A company is considering purchasing an IAM solution to manage multi-channel access to several cloud-based applications. This solution will also reduce help desk calls and increase user productivity by making application access easier with a single sign-on solution.<br />Is this a reason to choose an Okta solution, as described above?",
    "options": [
      {"text": "The company want sto enable a secure Bring Your Own Device (BYOD) policy for mobile phones",  "correct": true},
      {"text": "The company needs to secure and manage cloud applications",  "correct": true},
      {"text": "The company needs to provide SSO to a growing number of applications",  "correct": true},
      {"text": "The company has technical and data-center resources available for installing and housing the IAM solution",  "correct": false},
      {"text": "The company requires hosting servers for its cloud applications",  "correct": false},
      {"text": "The company wants to create a single system of record for employee and supplier identity",  "correct": true},
      {"text": "Company users require access to a local file server",  "correct": false}
    ]
  },
  {
    "stem": "A marketing employee is asked to create a custom email template that includes corporate branding and legal verbiage.<br />Is this the scripting language used to customize an email template?",
    "options": [
      {"text": "JavaServer Pages",  "correct": false},
      {"text": "JavaScript",  "correct": false},
      {"text": "Expression Language and HTML",  "correct": true},
      {"text": "Velocity",  "correct": false}
    ]
  },
  {
    "stem": "Is this a way to search for an application in the Okta Integration Network (OIN)?",
    "options": [
      {"text": "Use the alphabetical navigation bar",  "correct": true},
      {"text": "Use the Categories",  "correct": true},
      {"text": "Use the Assignment Filter",  "correct": false},
      {"text": "Use the Integration Properties",  "correct": false}
    ]
  },
  {
    "stem": "Is this an inbound federated sign-on method supported by Okta?",
    "options": [
      {"text": "WS-Fed",  "correct": false},
      {"text": "OIDC",  "correct": false},
      {"text": "SWA",  "correct": false},
      {"text": "SAML",  "correct": true}
    ]
  },
  {
    "stem": "Is this a true statement about Okta API tokens?",
    "options": [
      {"text": "Tokens are secret and should be treated as passwords",  "correct": true},
      {"text": "Tokens permit Okta API access on behalf of a named Okta user account",  "correct": true},
      {"text": "Token values can be viewed in the Okta Administrator console up to ten days after they have been generated",  "correct": false},
      {"text": "The user creating the token must be enrolled in multifactor authentication (MFA)",  "correct": false},
      {"text": "The token is only visible during creation",  "correct": true}
      {"text": "Token expiration dates are automatically reset whenever they are used to authorize an API call",  "correct": true},
      {"text": "Tokens can be reactivated after they are revoked",  "correct": false}
    ]
  },
  {
    "stem": "An Okta user recently resigned from employment with a company. An IT administrator notices that deprovisioning tasks related to this user are still on the Administrator Dashboard. Automatic deprovisioning is enabled for downstream applications.<br />Is this why deprovisioning tasks are on the Administrator Dashboard?",
    "options": [
      {"text": "Automatic deprovisioning finished the deactivation process for the user",  "correct": false},
      {"text": "The application requires manual deprovisioning of the account from the downstream application directly",  "correct": false},
      {"text": "Automatic deprovisioning failed or could not be performed",  "correct": true}
    ]
  },
  {
    "stem": "The Okta administrator wants to add a layer of security by requiring that end users are prompted for an SMS text after logging on to Okta from outside the corporate network.<br />Is this a possible way to accomplish the task?",
    "options": [
      {"text": "Create a mobile policy",  "correct": false},
      {"text": "Enable multifactor authentication (MFA)",  "correct": true},
      {"text": "Create an Okta Sign-On policy",  "correct": true}
    ]
  },
  {
    "stem": "A company uses Okta to provide Single Sign-On (SSO) for users to access SaaS applications. All of the company's applications are web based, and most of them do not support any type of proprietary federated services.<br />Will the following authentication method support all of the web-based apps in this scenario?",
    "options": [
      {"text": "OpenID Connect (OIDC)",  "correct": false},
      {"text": "Web Services Federation (WS-Fed)",  "correct": false},
      {"text": "Secure Web Authentication (SWA)",  "correct": true}
    ]
  },
  {
    "stem": "Is this how an Okta Administrator assigns an application to an end user?",
    "options": [
      {"text": "Sign-on policy assignment",  "correct": false},
      {"text": "Enrollment policy assignment",  "correct": false},
      {"text": "Individual assignment",  "correct": true},
      {"text": "Org assignment",  "correct": false},
      {"text": "Group Assignment",  "correct": true}
    ]
  },
  {
    "stem": "Is this the Okta product that allows an Okta Administrator to create a custom authorization server?",
    "options": [
      {"text": "Universal Directory",  "correct": false},
      {"text": "Single Sign-On (SSO)",  "correct": false},
      {"text": "API Access Management",  "correct": true},
      {"text": "Adaptive Multifactor Authentication (MFA)",  "correct": false}
    ]
  },
  {
    "stem": "Is this a method of searching for an application in the Okta Integration Network (OIN)?",
    "options": [
      {"text": "Use the name of the application",  "correct": true},
      {"text": "Filter application by supported operating system",  "correct": false},
      {"text": "Filter application by developer name",  "correct": false},
      {"text": "Filter applications by category",  "correct": true},
      {"text": "Filter applications by integration properties, such as SAML or provisioning",  "correct": true}
    ]
  },
  {
    "stem": "Is this what an Okta Administrator should do to require multifactor re-enrollment for all users?",
    "options": [
      {"text": "Disable each user and then re-enable each user",  "correct": false},
      {"text": "Create an enrollment policy rule to un-assign factors for all users",  "correct": false},
      {"text": "Send a mass email message notifying all end users to re-enroll",  "correct": false},
      {"text": "Reset all end users' factor types in bulk",  "correct": true}
    ]
  },
  {
    "stem": "Can this task be accomplished with a group rule?",
    "options": [
      {"text": "Assign users to a specific admin role",  "correct": false},
      {"text": "Configure the sign-on process for users who are off the corporate network",  "correct": false}
    ]
  },
  {
    "stem": "Is this a true statement regarding Okta sign-on policy rules?",
    "options": [
      {"text": "A rule can be configured to exclude one or more groups",  "correct": false}
    ]
  }
]